OF_Sims/planar_Sims/higher_pop/100_cell_1dT/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 373;

boundaryField
{
    walls
    {
        type            fixedValue;
        value           uniform 372;
    }
    left
    {
    type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
        
    }
    centreline
    {
        type            fixedValue;
        value           uniform 373;
    }
        frontAndBack
    {
        type            zeroGradient;
    }

    /* #includeEtc "caseDicts/setConstraintTypes" */
}

// ************************************************************************* //
